class Department

	DEPARTMENTS = {
		"00003" => "33", # 総合系科目2016年度以降入学
		"00001" => "34", # 総合教育科目2015年度迄の入学
		"00002" => "35", # 言語系/言語教育科目
		"01001" => "1", # 文学部/基幹科目
		"01002" => "2", # キリスト教
		"01003" => "3", # 英米文学
		"01004" => "4", # ドイツ文学
		"01005" => "5", # フランス文学
		"01006" => "6", # 日本文学
		"01007" => "7", # 文芸・思想
		"01008" => "8", # 史学科
		"01009" => "9", # 教育学科
		"02005" => "11", # 経済・経済政策・会計
		"03001" => "14", # 経営
		"03002" => "15", # 国際経営
		"04001" => "16", # 数学
		"04002" => "17", # 物理
		"04003" => "18", # 化学
		"04004" => "19", # 生命理
		"05006" => "20", # 社学共通科目
		"05002" => "20", # 産業関係
		"06004" => "23", # 法学科・国際ビジネス法学科・政策
		"07001" => "10", # 異文化コミュニケーション
		"08001" => "26", # 観光
		"08002" => "27", # 交流文化
		"09001" => "28", # 福祉
		"09002" => "29", # コミュニティ福祉
		"09003" => "30", # スポーツウェルネス
		"10001" => "31", # 心理学科
		"10002" => "32", # 映像身体
		"11001" => "36" # GLAP
	}
	def initialize(data)
		@department_id = data
	end

	def select_department
		department = DEPARTMENTS[@department_id]
		department
	end

end
